# Summer Analytics 2022 - Basic Data Analysis

- ####  Welcome to your first assignment, on basic data analysis!
- #### This Assignment is ungraded



### 1) Import Pandas

In [ ]:
import pandas as pd

### 2) Import the dataset and  Assign it to a variable called users and use the 'user_id' as index

Use the following dataset
https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user

In [2]:
import pandas as pd
cols=['user_id','age','gender','occupation','zip-code']
users=pd.read_csv(' https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',sep='|',header=None,names=cols)
users.set_index(['user_id'])

         age  gender     occupation  zip-code
user_id
user_id  age  gender     occupation  zip_code
1         24       M     technician     85711
2         53       F          other     94043
3         23       M         writer     32067
4         24       M     technician     43537
...      ...     ...            ...       ...
939       26       F        student     33319
940       32       M  administrator     02215
941       20       M        student     97229
942       48       F      librarian     78209
943       22       M        student     77841

[944 rows x 4 columns]

### 3) Display the first 25 entries

In [3]:
users.head(25)

    user_id  age  gender     occupation  zip-code
0   user_id  age  gender     occupation  zip_code
1         1   24       M     technician     85711
2         2   53       F          other     94043
3         3   23       M         writer     32067
4         4   24       M     technician     43537
5         5   33       F          other     15213
6         6   42       M      executive     98101
7         7   57       M  administrator     91344
8         8   36       M  administrator     05201
9         9   29       M        student     01002
10       10   53       M         lawyer     90703
11       11   39       F          other     30329
12       12   28       F          other     06405
13       13   47       M       educator     29206
14       14   45       M      scientist     55106
15       15   49       F       educator     97301
16       16   21       M  entertainment     10309
17       17   30       M     programmer     06355
18       18   35       F          other     37212
19       19   40       M      librarian     02138
20       20   42       F      homemaker     95660
21       21   26       M         writer     30068
22       22   25       M         writer     40206
23       23   30       F         artist     48197
24       24   21       F         artist     94533

### 4) Display the last 10 entries

In [4]:
users.tail(10)

    user_id age gender     occupation zip-code
934     934  61      M       engineer    22902
935     935  42      M         doctor    66221
936     936  24      M          other    32789
937     937  48      M       educator    98072
938     938  38      F     technician    55038
939     939  26      F        student    33319
940     940  32      M  administrator    02215
941     941  20      M        student    97229
942     942  48      F      librarian    78209
943     943  22      M        student    77841

### 5) What is the number of observations in the dataset?

In [15]:
users.shape[0]

944

### 6) What is the number of columns in the dataset, also print the name of all the columns?

In [13]:
number_columns=users.shape[1]
name_columns=users.columns.tolist()
number_columns,name_columns

(5, ['user_id', 'age', 'gender', 'occupation', 'zip-code'])

### 7) What is the data type of each column?

In [5]:
users.dtypes

user_id       object
age           object
gender        object
occupation    object
zip-code      object
dtype: object

### 8) Print only the occupation column

In [11]:
users['occupation']

0         occupation
1         technician
2              other
3             writer
4         technician
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 944, dtype: object

### 9) How many different occupations are in this dataset?

In [20]:
users['occupation'].nunique()

22

### 10) What is the most frequent occupation?

In [12]:
values=users['occupation'].value_counts()
most_frequent=values.idxmax()
most_frequent_count=values.max()
most_frequent,most_frequent_count

('student', 196)

### 11) Summarize the DataFrame.

In [7]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 944 entries, 0 to 943
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     944 non-null    object
 1   age         944 non-null    object
 2   gender      944 non-null    object
 3   occupation  944 non-null    object
 4   zip-code    944 non-null    object
dtypes: object(5)
memory usage: 37.0+ KB

### 12) Summarize only the occupation column

In [8]:
users['occupation'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 944 entries, 0 to 943
Series name: occupation
Non-Null Count  Dtype
--------------  -----
944 non-null    object
dtypes: object(1)
memory usage: 7.5+ KB

### 13) What is the mean age of users?

In [10]:
users['age'].mean

<bound method Series.mean of 0      age
1       24
2       53
3       23
4       24
      ...
939     26
940     32
941     20
942     48
943     22
Name: age, Length: 944, dtype: object>

### 14) What is the age with least occurrence?

In [27]:
cout=users['age'].value_counts()
cout.idxmin()

'66'